package ex15_4;
/*)Вывести следующие сообщения в отформатированном виде (необходимо добавить спецификаторы формата):
        а) Строка: Чтобы написать код нам нужны 1)Язык программирования 2)Среда разработки 3)Воодушевление
        Вывод: Чтобы написать код нам нужны
        1)Язык программирования
        2)Среда разработки
        3)Воодушевление*/
public class ex15_4_a {
public static void main(String[] args) {

    String a = "Чтобы написать код нам нужны \n1)Язык программирования \n2)Среда разработки \n3)Воодушевление";
    System.out.println(a);
    }

}
